/**
 Создайте программу, выводящую на экран все четырёхзначные числа последовательности 1000 1003 1006 1009 1012 1015 …
 */
public class Task2_1 {
    public static void main(String[] args) {
        int number = 1000;
        while (number < 10000){
            System.out.println(number);
            number++;
        }


    }
}
